In [1]:
import pandas as pd
import numpy as np

In [17]:
df1 = pd.DataFrame({"key": list("bbacaab"), 'data1':range(7)})
df2 = pd.DataFrame({"key": list("abd"), 'data2':range(3)})

In [18]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [19]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [25]:
pd.merge(df1, df2, sort=False)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [21]:
pd.merge(df2, df1)

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

In [22]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [26]:
df1 = pd.DataFrame({"key1": list("bbacaab"), 'data1':range(7)})
df2 = pd.DataFrame({"key2": list("abd"), 'data2':range(3)})

In [28]:
pd.merge(df1, df2, left_on="key1", right_on="key2")

  key1  data1 key2  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [45]:
df1 = pd.DataFrame({"key1": list("bbacab"), 'data1':range(6)})
df2 = pd.DataFrame({"key2": list("ababd"), 'data2':range(5)})

In [39]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [40]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [42]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [46]:
df1.join(df2,how='outer')

  key1  data1 key2  data2
0    b      0    a    0.0
1    b      1    b    1.0
2    a      2    a    2.0
3    c      3    b    3.0
4    a      4    d    4.0
5    b      5  NaN    NaN